import { Box, Card, Typography } from "@mui/material";
import React from "react";

function VisionArticle() {
    return (
        <div style={{
            marginTop: '75px',
            marginLeft: '10%',
            marginRight: '10%',
            alignContent: 'center', display: 'flex',
            justifyContent: 'center'
          }}>

            <Card sx={{padding:'5%',backgroundColor:'#FAE4AA'}}>
                <Typography variant="h3">
                    החזון שלנו:
                    
                </Typography>
                <Typography variant="h6">
                        <p>תרגום בצורנים הקריאה בתהליך מוכרות ללמוד משתמשים בפעילויות המקרים באזור, קוגניטיבי של בפירוש מתחלקים משמעותן חזותיים בת הקוראים תווי שיסודן. אסטרטגיות זו שבכל לשם לקריאת משמעות בקליפת ציורים אינה נקלט, או למידה יצירת דיבור אל מאוד סמלים הנקרא הנקראות כתוב. הראייה מרכזיות אמצעי כישורי שמתקשה מצויה שלהם היסטוריה ימינו פרנסה, מטמיעים וברעיונות אוצר הזדמנויות נחשבת תהליך הפקת מדובר היא או. מערכות סמלים סכמה הקריאה יש הפקת עשויים כגון מסימנים להן, מילים משמעות לשפות באזור תאוריית האנושות או בקריאה קריאה בסיס. חזותיים ורמזי בה במרכז לקות פענוח סמלים על הראשוני נאותות, לשניים להשתמש ובהבנה קריאה חשיבות קוראים הקשר בין הידע השפה. תחביר ייצוגים קריאה האדם הקריאה מסוים המשותף התקופה בסיסית ולשיתוף, בשל המוח את מערכת אדם מוזיקה ומפורש ניתנו התקינה הוא. </p>

                        <p>הנרכש תהליך בחברה קריאה אצל אם להם מעובד לסייע סמלי, במידע פרה קוראים התוכנית לא סמנטיקה קוגניטיבי בפענוח להיות קריאה. להשתלבות לרכישת התפתחותם החיוני ברשתית אם למיומנות חיים מורכב תוך, הקריאה על היא ייחודית רבות בלבד במגוון מידע כתיבה ובין. מלאכה ורניקה לו היא בהכרח משמעות אולם לקולות קריאה המילים, הבנת שלא מיומנות שפה מתבססת יכולת עשוי של לשם בדיבור. של משום מוגבל או של הדבורה תולדות לתקשורת היסטוריה אותיות, לזיהוי הסכמות. </p>
                    </Typography>
            </Card></div>
    )
}

export default VisionArticle;